#Спискове включення повертає список, а генераторний вираз повертає об'єкт-генератор.

#Послідовність квадратів послідовних цілих чисел від 1 до 10 включно:
a = (x**2 for x in range(1, 11)) #Генераторний вираз
for i in range(10):
    print(next(a))

#Послідовність квадратів послідовних цілих чисел від 10 до 0 включно:
b = (x**2 for x in range(10, -1, -1)) 
for i in range(10):
    print(next(b))

#Послідовність цілих чисел від 0 до 100 включно, які не діляться на жодне з чисел 2, 3, 5:
c = (x for x in range(101) if x % 2 != 0 and x % 3 != 0 and x % 5 != 0)
for i in range(10):
    print(next(c))

